LearnScrapy.org
* 初窥scrapy
** 选择一个网站，http://www.mininova.org/today
** 定义要抓取的数据
#+BEGIN_SRC python

import scrapy
class TorrentItem(scrapy.Item):
    url = scrapy.Field()
    name = scrapy.Field()
    description = scrapy.Field()
    size = scrapy.Field()

#+END_SRC

** spider code
#+BEGIN_SRC python
from scrapy.contrib.spiders import CrawlSpider, Rule
from scrapy.contrib.linkextractors import LinkExtractor

class MininovaSpider(CrawlSpider):

    name = 'mininova'
    allowed_domains = ['mininova.org']
    start_urls = ['http://www.mininova.org/today']
    rules = [Rule(LinkExtractor(allow=['/tor/\d+']), 'parse_torrent')]

    def parse_torrent(self, response):
        torrent = TorrentItem()
        torrent['url'] = response.url
        torrent['name'] = response.xpath("//h1/text()").extract()
        torrent['description'] = response.xpath("//div[@id='description']").extract()
        torrent['size'] = response.xpath("//div[@id='info-left']/p[2]/text()[2]").extract()
        return torrent
#+END_SRC
** 执行spider，获取数据
scrapy crawl mininova -o scrapy_data.json
** 查看提取的数据
emacs scrapy_data.json

* 安装指南
** 安装scrapy
pip install scrapy

* scrapy 入门教程
