LearnScrapy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-27 周六 11:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2439d36">1. 初窥scrapy</a>
<ul>
<li><a href="#orgdea4a6d">1.1. 选择一个网站，</a></li>
<li><a href="#org9bffd81">1.2. 定义要抓取的数据</a></li>
<li><a href="#orgbd949f8">1.3. spider code</a></li>
<li><a href="#org0a89cff">1.4. 执行spider，获取数据</a></li>
<li><a href="#orga30b2b3">1.5. 查看提取的数据</a></li>
</ul>
</li>
<li><a href="#orgd6bcdc4">2. 安装指南</a>
<ul>
<li><a href="#org8295931">2.1. 安装scrapy</a></li>
</ul>
</li>
<li><a href="#org50891f4">3. scrapy 入门教程</a>
<ul>
<li><a href="#orgfdb9240">3.1. 创建一个scrapy项目</a></li>
<li><a href="#org8cd3371">3.2. 定义爬取的item</a></li>
<li><a href="#orgc89e65d">3.3. 编写spider并提取item</a>
<ul>
<li><a href="#org49dd864">3.3.1. 爬取</a></li>
<li><a href="#org88395f5">3.3.2. 提取item</a></li>
<li><a href="#orgbd2823a">3.3.3. selectors选择器</a></li>
<li><a href="#org10cf47d">3.3.4. 提取数据</a></li>
</ul>
</li>
<li><a href="#org3b813eb">3.4. 使用item</a></li>
<li><a href="#org3dd7856">3.5. 编写item pipeline来保存获取到的数据</a></li>
</ul>
</li>
<li><a href="#org9b8f759">4. 命令行工具</a>
<ul>
<li><a href="#org9fac3a0">4.1. 默认的scrapy的结构</a></li>
<li><a href="#org1682411">4.2. 使用scrapy工具</a></li>
<li><a href="#org6f90ec9">4.3. 创建项目</a></li>
<li><a href="#org3da1215">4.4. 控制项目</a></li>
<li><a href="#org4b73d96">4.5. 可用的scrapy命令</a>
<ul>
<li><a href="#org2e1979a">4.5.1. 全局命令：</a></li>
<li><a href="#org81cfbf7">4.5.2. 项目命令：</a></li>
<li><a href="#org79837f9">4.5.3. genspider</a></li>
<li><a href="#orgba668ac">4.5.4. crawl</a></li>
<li><a href="#orgf575225">4.5.5. check</a></li>
<li><a href="#org8bb4ec1">4.5.6. list</a></li>
<li><a href="#org53150c5">4.5.7. fetch</a></li>
<li><a href="#org3da4cea">4.5.8. view</a></li>
<li><a href="#orgc2678f5">4.5.9. settings</a></li>
<li><a href="#orgae24858">4.5.10. runspider</a></li>
<li><a href="#org105bc79">4.5.11. version</a></li>
<li><a href="#orgd943feb">4.5.12. deploy</a></li>
<li><a href="#orga1f8f15">4.5.13. bench</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org288783e">5. Items</a>
<ul>
<li><a href="#org6ebb895">5.1. 声明item</a></li>
<li><a href="#org10429ae">5.2. 与Item配合</a>
<ul>
<li><a href="#org552a7ac">5.2.1. 创建item</a></li>
<li><a href="#orga380b1b">5.2.2. 获取字段的值</a></li>
<li><a href="#orgf0eb787">5.2.3. 设置字段的值</a></li>
<li><a href="#orge8be8d6">5.2.4. 获取所有获取的值</a></li>
</ul>
</li>
<li><a href="#orgd2a035d">5.3. 其他任务</a>
<ul>
<li><a href="#org332f063">5.3.1. 复制item</a></li>
<li><a href="#org61686e6">5.3.2. 根据item创建字典</a></li>
<li><a href="#org2ced5fe">5.3.3. 根据字典创建item</a></li>
</ul>
</li>
<li><a href="#orgde54011">5.4. 扩展item</a></li>
</ul>
</li>
<li><a href="#org6e37ef3">6. spiders</a>
<ul>
<li><a href="#org9c1ed2c">6.1. spider参数</a></li>
<li><a href="#org29b57a2">6.2. 内置spider参考手册</a>
<ul>
<li><a href="#org96e61f2">6.2.1. spider</a></li>
<li><a href="#orgf6d7a2c">6.2.2. custom<sub>settings</sub></a></li>
<li><a href="#orgbb44399">6.2.3. crawler</a></li>
<li><a href="#org4a9c8eb">6.2.4. start<sub>requests</sub>()</a></li>
<li><a href="#org5f77bdd">6.2.5. parse(response)</a></li>
<li><a href="#org541eb30">6.2.6. log()</a></li>
<li><a href="#orgc4ee2ef">6.2.7. closed()</a></li>
</ul>
</li>
<li><a href="#org8f5e0f3">6.3. spider样例</a></li>
<li><a href="#org5e1052b">6.4. crawlspider样例</a></li>
<li><a href="#org80c6bf9">6.5. XMLFeedSpider</a></li>
<li><a href="#orgf9cee0d">6.6. CSVFeedSpider</a></li>
</ul>
</li>
<li><a href="#org44eca2b">7. 选择器</a>
<ul>
<li><a href="#org8f16252">7.1. 使用选择器</a></li>
<li><a href="#org7d091dd">7.2. 嵌套选择器</a></li>
<li><a href="#org93d49f7">7.3. 正则表达式</a></li>
<li><a href="#org1d11ade">7.4. 使用相对路径</a></li>
<li><a href="#orga42f9eb">7.5. 使用建议</a>
<ul>
<li><a href="#org717c253">7.5.1. Using text nodes in a condition</a></li>
<li><a href="#org29a1cd9">7.5.2. Beware the difference between //node[1] and (//node)[1]</a></li>
<li><a href="#org734d9e2">7.5.3. When querying by class, consider using CSS</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1d3c969">8. Item Loaders</a>
<ul>
<li><a href="#org7d0dcfd">8.1. Using Item Loaders to populate items</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="org2439d36" class="outline-2">
<h2 id="org2439d36"><span class="section-number-2">1</span> 初窥scrapy</h2>
<div class="outline-text-2" id="text-1">
</div><div id="orgdea4a6d" class="outline-3">
<h3 id="orgdea4a6d"><span class="section-number-3">1.1</span> 选择一个网站，<a href="http://www.mininova.org/today">http://www.mininova.org/today</a></h3>
</div>
<div id="org9bffd81" class="outline-3">
<h3 id="org9bffd81"><span class="section-number-3">1.2</span> 定义要抓取的数据</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> scrapy
<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">TorrentItem</span>(scrapy.Item):
    <span style="color: #268bd2;">url</span> = scrapy.Field()
    <span style="color: #268bd2;">name</span> = scrapy.Field()
    <span style="color: #268bd2;">description</span> = scrapy.Field()
    <span style="color: #268bd2;">size</span> = scrapy.Field()
</pre>
</div>
</div>
</div>

<div id="orgbd949f8" class="outline-3">
<h3 id="orgbd949f8"><span class="section-number-3">1.3</span> spider code</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">from</span> scrapy.contrib.spiders <span style="color: #859900; font-weight: bold;">import</span> CrawlSpider, Rule
<span style="color: #859900; font-weight: bold;">from</span> scrapy.contrib.linkextractors <span style="color: #859900; font-weight: bold;">import</span> LinkExtractor

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">MininovaSpider</span>(CrawlSpider):

    <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">'mininova'</span>
    <span style="color: #268bd2;">allowed_domains</span> = [<span style="color: #2aa198;">'mininova.org'</span>]
    <span style="color: #268bd2;">start_urls</span> = [<span style="color: #2aa198;">'http://www.mininova.org/today'</span>]
    <span style="color: #268bd2;">rules</span> = [Rule(LinkExtractor(allow=[<span style="color: #2aa198;">'/tor/\d+'</span>]), <span style="color: #2aa198;">'parse_torrent'</span>)]

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">parse_torrent</span>(<span style="color: #859900; font-weight: bold;">self</span>, response):
        <span style="color: #268bd2;">torrent</span> = TorrentItem()
        <span style="color: #268bd2;">torrent</span>[<span style="color: #2aa198;">'url'</span>] = response.url
        <span style="color: #268bd2;">torrent</span>[<span style="color: #2aa198;">'name'</span>] = response.xpath(<span style="color: #2aa198;">"//h1/text()"</span>).extract()
        <span style="color: #268bd2;">torrent</span>[<span style="color: #2aa198;">'description'</span>] = response.xpath(<span style="color: #2aa198;">"//div[@id='description']"</span>).extract()
        <span style="color: #268bd2;">torrent</span>[<span style="color: #2aa198;">'size'</span>] = response.xpath(<span style="color: #2aa198;">"//div[@id='info-left']/p[2]/text()[2]"</span>).extract()
        <span style="color: #859900; font-weight: bold;">return</span> torrent
</pre>
</div>
</div>
</div>
<div id="org0a89cff" class="outline-3">
<h3 id="org0a89cff"><span class="section-number-3">1.4</span> 执行spider，获取数据</h3>
<div class="outline-text-3" id="text-1-4">
<p>
scrapy crawl mininova -o scrapy<sub>data.json</sub>
</p>
</div>
</div>
<div id="orga30b2b3" class="outline-3">
<h3 id="orga30b2b3"><span class="section-number-3">1.5</span> 查看提取的数据</h3>
<div class="outline-text-3" id="text-1-5">
<p>
emacs scrapy<sub>data.json</sub>
</p>
</div>
</div>
</div>

<div id="orgd6bcdc4" class="outline-2">
<h2 id="orgd6bcdc4"><span class="section-number-2">2</span> 安装指南</h2>
<div class="outline-text-2" id="text-2">
</div><div id="org8295931" class="outline-3">
<h3 id="org8295931"><span class="section-number-3">2.1</span> 安装scrapy</h3>
<div class="outline-text-3" id="text-2-1">
<p>
pip install scrapy
</p>
</div>
</div>
</div>
