LearnScrapy.html

<div id="org50891f4" class="outline-2">
<h2 id="org50891f4"><span class="section-number-2">3</span> scrapy 入门教程</h2>
<div class="outline-text-2" id="text-3">
</div><div id="orgfdb9240" class="outline-3">
<h3 id="orgfdb9240"><span class="section-number-3">3.1</span> 创建一个scrapy项目</h3>
<div class="outline-text-3" id="text-3-1">
<p>
scrapy startproject tutorial
</p>
<div class="org-src-container">
<pre class="src src-项目tree">tutorial/
    scrapy.cfg
    tutorial/
        __init__.py
        items.py
        pipelines.py
        settings.py
        spiders/
            __init__.py
            ...
</pre>
</div>
<p>
scrapy.cfg:项目配置文件
tutorial/项目Python模块，在此添加代码
tutorial/items.py:项目中的item文件
tutorial/pipelines.py:项目中的pipeline文件
tutorial/settings.py:项目中的配置文件
tutorial/spiders:放置spider代码
</p>
</div>
</div>
<div id="org8cd3371" class="outline-3">
<h3 id="org8cd3371"><span class="section-number-3">3.2</span> 定义爬取的item</h3>
<div class="outline-text-3" id="text-3-2">
<p>
编辑tutorial目录中的items.py
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> scrapy

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">DmozItem</span>(scrapy.Item):
    <span style="color: #268bd2;">title</span> = scrapy.Field()
    <span style="color: #268bd2;">link</span> = scrapy.Field()
    <span style="color: #268bd2;">desc</span> = scrapy.Field()
</pre>
</div>
</div>
</div>
<div id="orgc89e65d" class="outline-3">
<h3 id="orgc89e65d"><span class="section-number-3">3.3</span> 编写spider并提取item</h3>
<div class="outline-text-3" id="text-3-3">
<p>
spider必须继承scrapy.Spider,定义以下三个属性
name:用于区别spider，name唯一。
start<sub>urls</sub>:包含爬取的URL列表。
parse():spider的一个方法，负责解析返回的数据，提取数据，以及生成进一步处理的URL对象新建文件，保存在tutorial/spiders目录下，dmoz<sub>spider.py</sub>
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> scrapy

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">DmozSpider</span>(scrapy.spiders.Spider):
    <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">"dmoz"</span>
    <span style="color: #268bd2;">allowed_domains</span> = [<span style="color: #2aa198;">"dmoz.org"</span>]
    <span style="color: #268bd2;">start_urls</span> = [
        <span style="color: #2aa198;">"http://www.dmoz.org/Computers/Programming/Languages/Python/Books/"</span>,
        <span style="color: #2aa198;">"http://www.dmoz.org/Computers/Programming/Languages/Python/Resources/"</span>
    ]

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">parse</span>(<span style="color: #859900; font-weight: bold;">self</span>, response):
        <span style="color: #268bd2;">filename</span> = response.url.split(<span style="color: #2aa198;">"/"</span>)[-<span style="color: #6c71c4;">2</span>]
        <span style="color: #859900; font-weight: bold;">with</span> <span style="color: #657b83; font-weight: bold;">open</span>(filename, <span style="color: #2aa198;">'wb'</span>) <span style="color: #859900; font-weight: bold;">as</span> f:
            f.write(response.body)
</pre>
</div>
</div>
<div id="org49dd864" class="outline-4">
<h4 id="org49dd864"><span class="section-number-4">3.3.1</span> 爬取</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
scrapy crawl dmoz
</p>
</div>
</div>
<div id="org88395f5" class="outline-4">
<h4 id="org88395f5"><span class="section-number-4">3.3.2</span> 提取item</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
scrapy使用xpath和css表达式机制
example：
/html/head/title:选择HTML文档中head标签内的title元素
/html/head/title/text():上面title元素的文字
//td:选择所有的td元素
//div[@class='mine']:选择所有的具有class=‘mine’的div元素
www.w3school.com.cn/xpath/index.asp
</p>
</div>
</div>
<div id="orgbd2823a" class="outline-4">
<h4 id="orgbd2823a"><span class="section-number-4">3.3.3</span> selectors选择器</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
xpath():传入xpath表达式，返回节点list
css():传入css表达式，返回节点list
extract():序列化改节点为Unicode字符，返回list
re():根据正则表达式对数据进行提取，返回Unicode list
</p>
</div>
</div>

<div id="org10cf47d" class="outline-4">
<h4 id="org10cf47d"><span class="section-number-4">3.3.4</span> 提取数据</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
在终端输入response.body查看HTML
</p>
<div class="org-src-container">
<pre class="src src-python">sel.xpath(<span style="color: #2aa198;">'//ul/li'</span>)
sel.xpath(<span style="color: #2aa198;">'//ul/li/text()'</span>).extract()
<span style="color: #859900; font-weight: bold;">for</span> sel <span style="color: #859900; font-weight: bold;">in</span> response.xpath(<span style="color: #2aa198;">'//ul/li'</span>):
    <span style="color: #268bd2;">title</span> = sel.xpath(<span style="color: #2aa198;">'a/text()'</span>).extract()
    <span style="color: #268bd2;">link</span> = sel.xpath(<span style="color: #2aa198;">'a/@href'</span>).extract()
    <span style="color: #268bd2;">desc</span> = sel.xpath(<span style="color: #2aa198;">'text()'</span>).extract()
    <span style="color: #859900; font-weight: bold;">print</span> title, link, desc
</pre>
</div>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> scrapy

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">DmozSpider</span>(scrapy.Spider):
    <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">"dmoz"</span>
    <span style="color: #268bd2;">allowed_domains</span> = [<span style="color: #2aa198;">"dmoz.org"</span>]
    <span style="color: #268bd2;">start_urls</span> = [
        <span style="color: #2aa198;">"http://www.dmoz.org/Computers/Programming/Languages/Python/Books/"</span>,
        <span style="color: #2aa198;">"http://www.dmoz.org/Computers/Programming/Languages/Python/Resources/"</span>
    ]

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">parse</span>(<span style="color: #859900; font-weight: bold;">self</span>, response):
        <span style="color: #859900; font-weight: bold;">for</span> sel <span style="color: #859900; font-weight: bold;">in</span> response.xpath(<span style="color: #2aa198;">'//ul/li'</span>):
            <span style="color: #268bd2;">title</span> = sel.xpath(<span style="color: #2aa198;">'a/text()'</span>).extract()
            <span style="color: #268bd2;">link</span> = sel.xpath(<span style="color: #2aa198;">'a/@href'</span>).extract()
            <span style="color: #268bd2;">desc</span> = sel.xpath(<span style="color: #2aa198;">'text()'</span>).extract()
            <span style="color: #859900; font-weight: bold;">print</span> title, link, desc
</pre>
</div>
</div>
</div>
</div>
<div id="org3b813eb" class="outline-3">
<h3 id="org3b813eb"><span class="section-number-3">3.4</span> 使用item</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> scrapy

<span style="color: #859900; font-weight: bold;">from</span> tutorial.items <span style="color: #859900; font-weight: bold;">import</span> DmozItem

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">DmozSpider</span>(scrapy.Spider):
    <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">"dmoz"</span>
    <span style="color: #268bd2;">allowed_domains</span> = [<span style="color: #2aa198;">"dmoz.org"</span>]
    <span style="color: #268bd2;">start_urls</span> = [
        <span style="color: #2aa198;">"http://www.dmoz.org/Computers/Programming/Languages/Python/Books/"</span>,
        <span style="color: #2aa198;">"http://www.dmoz.org/Computers/Programming/Languages/Python/Resources/"</span>
    ]

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">parse</span>(<span style="color: #859900; font-weight: bold;">self</span>, response):
        <span style="color: #859900; font-weight: bold;">for</span> sel <span style="color: #859900; font-weight: bold;">in</span> response.xpath(<span style="color: #2aa198;">'//ul/li'</span>):
            <span style="color: #268bd2;">item</span> = DmozItem()
            <span style="color: #268bd2;">item</span>[<span style="color: #2aa198;">'title'</span>] = sel.xpath(<span style="color: #2aa198;">'a/text()'</span>).extract()
            <span style="color: #268bd2;">item</span>[<span style="color: #2aa198;">'link'</span>] = sel.xpath(<span style="color: #2aa198;">'a/@href'</span>).extract()
            <span style="color: #268bd2;">item</span>[<span style="color: #2aa198;">'desc'</span>] = sel.xpath(<span style="color: #2aa198;">'text()'</span>).extract()
            <span style="color: #859900; font-weight: bold;">yield</span> item
</pre>
</div>
</div>
</div>
