LearnScrapy.md


<a id="orgffb2f9d"></a>

# scrapy 入门教程


<a id="org89549e2"></a>

## 创建一个scrapy项目

scrapy startproject tutorial

    tutorial/
        scrapy.cfg
        tutorial/
            __init__.py
            items.py
            pipelines.py
            settings.py
            spiders/
                __init__.py
                ...

scrapy.cfg:项目配置文件
tutorial/项目Python模块，在此添加代码
tutorial/items.py:项目中的item文件
tutorial/pipelines.py:项目中的pipeline文件
tutorial/settings.py:项目中的配置文件
tutorial/spiders:放置spider代码


<a id="org8438223"></a>

## 定义爬取的item

编辑tutorial目录中的items.py

    import scrapy
    
    class DmozItem(scrapy.Item):
        title = scrapy.Field()
        link = scrapy.Field()
        desc = scrapy.Field()


<a id="org1db6309"></a>

## 编写spider并提取item

spider必须继承scrapy.Spider,定义以下三个属性
name:用于区别spider，name唯一。
start<sub>urls</sub>:包含爬取的URL列表。
parse():spider的一个方法，负责解析返回的数据，提取数据，以及生成进一步处理的URL对象
新建文件，保存在tutorial/spiders目录下，dmoz<sub>spider.py</sub>

    import scrapy
    
    class DmozSpider(scrapy.spiders.Spider):
        name = "dmoz"
        allowed_domains = ["dmoz.org"]
        start_urls = [
            "http://www.dmoz.org/Computers/Programming/Languages/Python/Books/",
            "http://www.dmoz.org/Computers/Programming/Languages/Python/Resources/"
        ]
    
        def parse(self, response):
            filename = response.url.split("/")[-2]
            with open(filename, 'wb') as f:
                f.write(response.body)


<a id="orgc89d909"></a>

### 爬取

scrapy crawl dmoz


<a id="orgc4aafb7"></a>

### 提取item

scrapy使用xpath和css表达式机制
example：
/html/head/title:选择HTML文档中head标签内的title元素
/html/head/title/text():上面title元素的文字
//td:选择所有的td元素
//div[@class='mine']:选择所有的具有class=‘mine’的div元素
www.w3school.com.cn/xpath/index.asp


<a id="orga307cb4"></a>

### selectors选择器

xpath():传入xpath表达式，返回节点list
css():传入css表达式，返回节点list
extract():序列化改节点为Unicode字符，返回list
re():根据正则表达式对数据进行提取，返回Unicode list


<a id="org01aa1d7"></a>

### 提取数据

在终端输入response.body查看HTML

    sel.xpath('//ul/li')
    sel.xpath('//ul/li/text()').extract()
    for sel in response.xpath('//ul/li'):
        title = sel.xpath('a/text()').extract()
        link = sel.xpath('a/@href').extract()
        desc = sel.xpath('text()').extract()
        print title, link, desc

    import scrapy
    
    class DmozSpider(scrapy.Spider):
        name = "dmoz"
        allowed_domains = ["dmoz.org"]
        start_urls = [
            "http://www.dmoz.org/Computers/Programming/Languages/Python/Books/",
            "http://www.dmoz.org/Computers/Programming/Languages/Python/Resources/"
        ]
    
        def parse(self, response):
            for sel in response.xpath('//ul/li'):
                title = sel.xpath('a/text()').extract()
                link = sel.xpath('a/@href').extract()
                desc = sel.xpath('text()').extract()
                print title, link, desc


<a id="org514aa40"></a>

## 使用item

    import scrapy
    
    from tutorial.items import DmozItem
    
    class DmozSpider(scrapy.Spider):
        name = "dmoz"
        allowed_domains = ["dmoz.org"]
        start_urls = [
            "http://www.dmoz.org/Computers/Programming/Languages/Python/Books/",
            "http://www.dmoz.org/Computers/Programming/Languages/Python/Resources/"
        ]
    
        def parse(self, response):
            for sel in response.xpath('//ul/li'):
                item = DmozItem()
                item['title'] = sel.xpath('a/text()').extract()
                item['link'] = sel.xpath('a/@href').extract()
                item['desc'] = sel.xpath('text()').extract()
                yield item
