LearnScrapy.html
<div id="org3dd7856" class="outline-3">
<h3 id="org3dd7856"><span class="section-number-3">3.5</span> 编写item pipeline来保存获取到的数据</h3>
<div class="outline-text-3" id="text-3-5">
<p>
保存爬取到的数据
</p>
<div class="org-src-container">
<pre class="src src-python">scrapy crawl dmoz -o items.json
</pre>
</div>
</div>
</div>
</div>
<div id="org9b8f759" class="outline-2">
<h2 id="org9b8f759"><span class="section-number-2">4</span> 命令行工具</h2>
<div class="outline-text-2" id="text-4">
</div><div id="org9fac3a0" class="outline-3">
<h3 id="org9fac3a0"><span class="section-number-3">4.1</span> 默认的scrapy的结构</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-scrapy">scrapy.cfg
myproject/
    __init__.py
    items.py
    pipelines.py
    settings.py
    spiders/
        __init__.py
        spider1.py
        spider2.py
        ...
</pre>
</div>
</div>
</div>
<div id="org1682411" class="outline-3">
<h3 id="org1682411"><span class="section-number-3">4.2</span> 使用scrapy工具</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-scrapy">Scrapy 1.3.0 - no active project

Usage:
  scrapy &lt;command&gt; [options] [args]

Available commands:
  bench         Run quick benchmark test
  commands
  fetch         Fetch a URL using the Scrapy downloader
  genspider     Generate new spider using pre-defined templates
  runspider     Run a self-contained spider (without creating a project)
  settings      Get settings values
  shell         Interactive scraping console
  startproject  Create new project
  version       Print Scrapy version
  view          Open URL in browser, as seen by Scrapy

  [ more ]      More commands available when run from project directory

Use "scrapy &lt;command&gt; -h" to see more info about a command
</pre>
</div>
</div>
</div>
<div id="org6f90ec9" class="outline-3">
<h3 id="org6f90ec9"><span class="section-number-3">4.3</span> 创建项目</h3>
<div class="outline-text-3" id="text-4-3">
<p>
scrapy startproject myproject
cd myproject
然后可以使用scrapy命令来控制项目
</p>
</div>
</div>

<div id="org3da1215" class="outline-3">
<h3 id="org3da1215"><span class="section-number-3">4.4</span> 控制项目</h3>
<div class="outline-text-3" id="text-4-4">
<p>
创建一个新的spider：scrapy genspider mydomain mydomain.com
</p>
</div>
</div>
<div id="org4b73d96" class="outline-3">
<h3 id="org4b73d96"><span class="section-number-3">4.5</span> 可用的scrapy命令</h3>
<div class="outline-text-3" id="text-4-5">
<p>
scrapy&lt;command&gt; -h
</p>
</div>
<div id="org2e1979a" class="outline-4">
<h4 id="org2e1979a"><span class="section-number-4">4.5.1</span> 全局命令：</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
startproject,settings,runspider,shell,fetch,view,version
</p>
</div>
</div>
<div id="org81cfbf7" class="outline-4">
<h4 id="org81cfbf7"><span class="section-number-4">4.5.2</span> 项目命令：</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
crawl,check,list,edit,parse,genspider,deploy,bench
</p>
</div>
</div>

<div id="org79837f9" class="outline-4">
<h4 id="org79837f9"><span class="section-number-4">4.5.3</span> genspider</h4>
<div class="outline-text-4" id="text-4-5-3">
<p>
在项目中创建spider
scrapy genspider [-t template] &lt;name&gt; &lt;domain&gt;
查看模板：scrapy genspider -l
查看详细信息：scrapy genspider -d basic
使用模板：scrapy genspider -t basic example example.com
</p>
</div>
</div>
<div id="orgba668ac" class="outline-4">
<h4 id="orgba668ac"><span class="section-number-4">4.5.4</span> crawl</h4>
<div class="outline-text-4" id="text-4-5-4">
<p>
语法：scrapy crawl &lt;spider&gt;
</p>
</div>
</div>
<div id="orgf575225" class="outline-4">
<h4 id="orgf575225"><span class="section-number-4">4.5.5</span> check</h4>
<div class="outline-text-4" id="text-4-5-5">
<p>
scrapy check [-l] &lt;spider&gt;
</p>
</div>
</div>
<div id="org8bb4ec1" class="outline-4">
<h4 id="org8bb4ec1"><span class="section-number-4">4.5.6</span> list</h4>
<div class="outline-text-4" id="text-4-5-6">
<p>
列出所有的spider：scrapy list
</p>
</div>
</div>
<div id="org53150c5" class="outline-4">
<h4 id="org53150c5"><span class="section-number-4">4.5.7</span> fetch</h4>
<div class="outline-text-4" id="text-4-5-7">
<p>
scrapy fetch url
scrapy fetch &#x2013;nolog &#x2013;headers <a href="https://www.baidu.com">https://www.baidu.com</a>
</p>
</div>
</div>
<div id="org3da4cea" class="outline-4">
<h4 id="org3da4cea"><span class="section-number-4">4.5.8</span> view</h4>
<div class="outline-text-4" id="text-4-5-8">
<p>
在浏览器打开给定的URL
scrapy view url
</p>
</div>
</div>
<div id="orgc2678f5" class="outline-4">
<h4 id="orgc2678f5"><span class="section-number-4">4.5.9</span> settings</h4>
<div class="outline-text-4" id="text-4-5-9">
<p>
scrapy settings &#x2013;get BOT<sub>NAME</sub>
scrapy settings &#x2013;get DOWNLOAD<sub>DELAY</sub>
</p>
</div>
</div>
<div id="orgae24858" class="outline-4">
<h4 id="orgae24858"><span class="section-number-4">4.5.10</span> runspider</h4>
<div class="outline-text-4" id="text-4-5-10">
<p>
scrapy runspider &lt;spider<sub>file.py</sub>&gt;
运行一个为创建项目的spider
</p>
</div>
</div>
<div id="org105bc79" class="outline-4">
<h4 id="org105bc79"><span class="section-number-4">4.5.11</span> version</h4>
<div class="outline-text-4" id="text-4-5-11">
<p>
scrapy version -v
Scrapy    : 1.3.0
lxml      : 3.7.1.0
libxml2   : 2.9.4
cssselect : 1.0.1
parsel    : 1.1.0
w3lib     : 1.16.0
Twisted   : 16.6.0
Python    : 3.5.2 (v3.5.2:4def2a2901a5, Jun 25 2016, 22:18:55) [MSC v.1900 64 bit (AMD64)]
pyOpenSSL : 16.2.0 (OpenSSL 1.0.2k  26 Jan 2017)
Platform  : Windows-7-6.1.7601-SP1
</p>
</div>
</div>
<div id="orgd943feb" class="outline-4">
<h4 id="orgd943feb"><span class="section-number-4">4.5.12</span> deploy</h4>
<div class="outline-text-4" id="text-4-5-12">
<p>
scrapy deploy [ &lt;target:project&gt; | -l &lt;target&gt; | -L ]
</p>
</div>
</div>
<div id="orga1f8f15" class="outline-4">
<h4 id="orga1f8f15"><span class="section-number-4">4.5.13</span> bench</h4>
<div class="outline-text-4" id="text-4-5-13">
<p>
scrapy bench
运行benchmark测试
</p>
</div>
</div>
</div>
</div>
<div id="org288783e" class="outline-2">
<h2 id="org288783e"><span class="section-number-2">5</span> Items</h2>
<div class="outline-text-2" id="text-5">
<p>
Item 对象是种简单的容器，保存了爬取到得数据。 其提供了 类似于词典(dictionary-like) 的API以及用于声明可用字段的简单语法
</p>
</div>
<div id="org6ebb895" class="outline-3">
<h3 id="org6ebb895"><span class="section-number-3">5.1</span> 声明item</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> scrapy

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">Product</span>(scrapy.Item):
    <span style="color: #268bd2;">name</span> = scrapy.Field()
    <span style="color: #268bd2;">price</span> = scrapy.Field()
    <span style="color: #268bd2;">stock</span> = scrapy.Field()
    <span style="color: #268bd2;">last_updated</span> = scrapy.Field(serializer=<span style="color: #657b83; font-weight: bold;">str</span>)
</pre>
</div>
</div>
</div>
<div id="org10429ae" class="outline-3">
<h3 id="org10429ae"><span class="section-number-3">5.2</span> 与Item配合</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="org552a7ac" class="outline-4">
<h4 id="org552a7ac"><span class="section-number-4">5.2.1</span> 创建item</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">product</span> = Product(name=<span style="color: #2aa198;">'Desktop PC'</span>, price=<span style="color: #6c71c4;">1000</span>)
<span style="color: #859900; font-weight: bold;">print</span> product
Product(name=<span style="color: #2aa198;">'Desktop PC'</span>, price=<span style="color: #6c71c4;">1000</span>)
</pre>
</div>
</div>
</div>
