LearnScrapy.md


<a id="org1ee792e"></a>

## 编写item pipeline来保存获取到的数据

保存爬取到的数据

    scrapy crawl dmoz -o items.json


<a id="orgfe73673"></a>

# 命令行工具


<a id="org3a444f0"></a>

## 默认的scrapy的结构

    scrapy.cfg
    myproject/
        __init__.py
        items.py
        pipelines.py
        settings.py
        spiders/
            __init__.py
            spider1.py
            spider2.py
            ...


<a id="org1b1cc03"></a>

## 使用scrapy工具

    Scrapy 1.3.0 - no active project
    
    Usage:
      scrapy <command> [options] [args]
    
    Available commands:
      bench         Run quick benchmark test
      commands
      fetch         Fetch a URL using the Scrapy downloader
      genspider     Generate new spider using pre-defined templates
      runspider     Run a self-contained spider (without creating a project)
      settings      Get settings values
      shell         Interactive scraping console
      startproject  Create new project
      version       Print Scrapy version
      view          Open URL in browser, as seen by Scrapy
    
      [ more ]      More commands available when run from project directory
    
    Use "scrapy <command> -h" to see more info about a command


<a id="org8264088"></a>

## 创建项目

scrapy startproject myproject
cd myproject
然后可以使用scrapy命令来控制项目


<a id="org0ed05fd"></a>

## 控制项目

创建一个新的spider：scrapy genspider mydomain mydomain.com


<a id="org0b5e5d3"></a>

## 可用的scrapy命令

scrapy<command> -h


<a id="orgf004337"></a>

### 全局命令：

startproject,settings,runspider,shell,fetch,view,version


<a id="org19999b4"></a>

### 项目命令：

crawl,check,list,edit,parse,genspider,deploy,bench


<a id="org2d0475e"></a>

### genspider

在项目中创建spider
scrapy genspider [-t template] <name> <domain>
查看模板：scrapy genspider -l
查看详细信息：scrapy genspider -d basic
使用模板：scrapy genspider -t basic example example.com


<a id="orgfdc3492"></a>

### crawl

语法：scrapy crawl <spider>


<a id="org6654264"></a>

### check

scrapy check [-l] <spider>


<a id="org2c43a43"></a>

### list

列出所有的spider：scrapy list


<a id="org2347acc"></a>

### fetch

scrapy fetch url
scrapy fetch &#x2013;nolog &#x2013;headers <https://www.baidu.com>


<a id="org3a8c80c"></a>

### view

在浏览器打开给定的URL
scrapy view url


<a id="org37f733c"></a>

### settings

scrapy settings &#x2013;get BOT<sub>NAME</sub>
scrapy settings &#x2013;get DOWNLOAD<sub>DELAY</sub>


<a id="org998b44a"></a>

### runspider

scrapy runspider <spider<sub>file.py</sub>>
运行一个为创建项目的spider


<a id="org94af696"></a>

### version

scrapy version -v
Scrapy    : 1.3.0
lxml      : 3.7.1.0
libxml2   : 2.9.4
cssselect : 1.0.1
parsel    : 1.1.0
w3lib     : 1.16.0
Twisted   : 16.6.0
Python    : 3.5.2 (v3.5.2:4def2a2901a5, Jun 25 2016, 22:18:55) [MSC v.1900 64 bit (AMD64)]
pyOpenSSL : 16.2.0 (OpenSSL 1.0.2k  26 Jan 2017)
Platform  : Windows-7-6.1.7601-SP1


<a id="orge507cf8"></a>

### deploy

scrapy deploy [ <target:project> | -l <target> | -L ]


<a id="orgcffd6fc"></a>

### bench

scrapy bench
运行benchmark测试


<a id="org2392b93"></a>

# Items

Item 对象是种简单的容器，保存了爬取到得数据。 其提供了 类似于词典(dictionary-like) 的API以及用于声明可用字段的简单语法


<a id="orga42e8c1"></a>

## 声明item

    import scrapy
    
    class Product(scrapy.Item):
        name = scrapy.Field()
        price = scrapy.Field()
        stock = scrapy.Field()
        last_updated = scrapy.Field(serializer=str)


<a id="org35089a4"></a>

## 与Item配合


<a id="orgbc3836c"></a>

### 创建item

    product = Product(name='Desktop PC', price=1000)
    print product
    Product(name='Desktop PC', price=1000)
