LearnScrapy.org
*** 获取字段的值
#+BEGIN_SRC python
product['name']
Desktop PC
product.get('name')
Desktop PC

product['price']
1000

product['last_updated']
Traceback (most recent call last):
    ...
KeyError: 'last_updated'

product.get('last_updated', 'not set')
not set

product['lala'] # getting unknown field
Traceback (most recent call last):
    ...
KeyError: 'lala'

product.get('lala', 'unknown field')
'unknown field'

'name' in product  # is name field populated?
True

'last_updated' in product  # is last_updated populated?
False

'last_updated' in product.fields  # is last_updated a declared field?
True

'lala' in product.fields  # is lala a declared field?
False

#+END_SRC
*** 设置字段的值
#+BEGIN_SRC python
product['last_updated'] = 'today'
product['last_updated']
today

product['lala'] = 'test' # setting unknown field
Traceback (most recent call last):
    ...
KeyError: 'Product does not support field: lala'
#+END_SRC
*** 获取所有获取的值
product.keys()
product.items()
** 其他任务
*** 复制item
product2 = Product(product)
product3 = product2.copy()
*** 根据item创建字典
dict(product)
*** 根据字典创建item
Product({'name':'niuniu','price':'expensive'})
Product({'name':'niuniu','lala':'expensive'})#error
** 扩展item
继承原始的item来扩展item
#+BEGIN_SRC python
class DiscountedProduct(Product):
    discount_percent = scrapy.Field(serializer=str)
    discount_expiration_date = scrapy.Field()
#+END_SRC
* spiders
定义爬取动作，分析网页的地方
spider中初始的request是通过调用 start_requests() 来获取的。
start_requests() 读取 start_urls 中的URL， 并以 parse 为回调函数生成 Request 。
** spider参数
在运行crawl时，添加-a可以传递spider参数：
scrapy crawl myspider -a category=electronics
spider在构造中获取参数
#+BEGIN_SRC python
import scrapy

class MySpider(Spider):
    name = 'myspider'

    def __init__(self, category=None, *args, **kwargs):
        super(MySpider, self).__init__(*args, **kwargs)
        self.start_urls = ['http://www.example.com/categories/%s' % category]
        # ...
#+END_SRC
** 内置spider参考手册
*** spider
Spider并没有提供什么特殊的功能。 其仅仅请求给定的 start_urls/start_requests，
并根据返回的结果(resulting responses)调用spider的 parse 方法。
name:定义spider名字的字符串，唯一。
allowed_domains:允许爬取的域名列表
start_urls:url列表，没有特定的URL时，从该列表开始爬取。
*** custom_settings
for detail: http://scrapy-chs.readthedocs.io/zh_CN/latest/topics/settings.html#topics-settings-ref
*** crawler
for detail: http://scrapy-chs.readthedocs.io/zh_CN/latest/topics/api.html#topics-api-crawler
*** start_requests()
返回一个可迭代的对象，默认使用start_urls的url生成requests.
可以重写该方法
#+BEGIN_SRC python
def start_requests(self):
    return [scrapy.FormRequest("http://www.example.com/login",
                               formdata={'user': 'john', 'pass': 'secret'},
                               callback=self.logged_in)]

def logged_in(self, response):
    # here you would extract links to follow and return Requests for
    # each of them, with another callback
    pass
#+END_SRC
