LearnScrapy.html
<div id="orga380b1b" class="outline-4">
<h4 id="orga380b1b"><span class="section-number-4">5.2.2</span> 获取字段的值</h4>
<div class="outline-text-4" id="text-5-2-2">
<div class="org-src-container">
<pre class="src src-python">product[<span style="color: #2aa198;">'name'</span>]
Desktop PC
product.get(<span style="color: #2aa198;">'name'</span>)
Desktop PC

product[<span style="color: #2aa198;">'price'</span>]
<span style="color: #6c71c4;">1000</span>

product[<span style="color: #2aa198;">'last_updated'</span>]
Traceback (most recent call last):
    ...
<span style="color: #b58900;">KeyError</span>: <span style="color: #2aa198;">'last_updated'</span>

product.get(<span style="color: #2aa198;">'last_updated'</span>, <span style="color: #2aa198;">'not set'</span>)
<span style="color: #859900; font-weight: bold;">not</span> <span style="color: #657b83; font-weight: bold;">set</span>

product[<span style="color: #2aa198;">'lala'</span>] <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">getting unknown field</span>
Traceback (most recent call last):
    ...
<span style="color: #b58900;">KeyError</span>: <span style="color: #2aa198;">'lala'</span>

product.get(<span style="color: #2aa198;">'lala'</span>, <span style="color: #2aa198;">'unknown field'</span>)
<span style="color: #2aa198;">'unknown field'</span>

<span style="color: #2aa198;">'name'</span> <span style="color: #859900; font-weight: bold;">in</span> product  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">is name field populated?</span>
<span style="color: #268bd2; font-weight: bold;">True</span>

<span style="color: #2aa198;">'last_updated'</span> <span style="color: #859900; font-weight: bold;">in</span> product  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">is last_updated populated?</span>
<span style="color: #268bd2; font-weight: bold;">False</span>

<span style="color: #2aa198;">'last_updated'</span> <span style="color: #859900; font-weight: bold;">in</span> product.fields  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">is last_updated a declared field?</span>
<span style="color: #268bd2; font-weight: bold;">True</span>

<span style="color: #2aa198;">'lala'</span> <span style="color: #859900; font-weight: bold;">in</span> product.fields  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">is lala a declared field?</span>
<span style="color: #268bd2; font-weight: bold;">False</span>
</pre>
</div>
</div>
</div>
<div id="orgf0eb787" class="outline-4">
<h4 id="orgf0eb787"><span class="section-number-4">5.2.3</span> 设置字段的值</h4>
<div class="outline-text-4" id="text-5-2-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">product</span>[<span style="color: #2aa198;">'last_updated'</span>] = <span style="color: #2aa198;">'today'</span>
product[<span style="color: #2aa198;">'last_updated'</span>]
today

<span style="color: #268bd2;">product</span>[<span style="color: #2aa198;">'lala'</span>] = <span style="color: #2aa198;">'test'</span> <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">setting unknown field</span>
Traceback (most recent call last):
    ...
<span style="color: #b58900;">KeyError</span>: <span style="color: #2aa198;">'Product does not support field: lala'</span>
</pre>
</div>
</div>
</div>
<div id="orge8be8d6" class="outline-4">
<h4 id="orge8be8d6"><span class="section-number-4">5.2.4</span> 获取所有获取的值</h4>
<div class="outline-text-4" id="text-5-2-4">
<p>
product.keys()
product.items()
</p>
</div>
</div>
</div>
<div id="orgd2a035d" class="outline-3">
<h3 id="orgd2a035d"><span class="section-number-3">5.3</span> 其他任务</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="org332f063" class="outline-4">
<h4 id="org332f063"><span class="section-number-4">5.3.1</span> 复制item</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
product2 = Product(product)
product3 = product2.copy()
</p>
</div>
</div>
<div id="org61686e6" class="outline-4">
<h4 id="org61686e6"><span class="section-number-4">5.3.2</span> 根据item创建字典</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
dict(product)
</p>
</div>
</div>
<div id="org2ced5fe" class="outline-4">
<h4 id="org2ced5fe"><span class="section-number-4">5.3.3</span> 根据字典创建item</h4>
<div class="outline-text-4" id="text-5-3-3">
<p>
Product({'name':'niuniu','price':'expensive'})
Product({'name':'niuniu','lala':'expensive'})#error
</p>
</div>
</div>
</div>
<div id="orgde54011" class="outline-3">
<h3 id="orgde54011"><span class="section-number-3">5.4</span> 扩展item</h3>
<div class="outline-text-3" id="text-5-4">
<p>
继承原始的item来扩展item
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">DiscountedProduct</span>(Product):
    <span style="color: #268bd2;">discount_percent</span> = scrapy.Field(serializer=<span style="color: #657b83; font-weight: bold;">str</span>)
    <span style="color: #268bd2;">discount_expiration_date</span> = scrapy.Field()
</pre>
</div>
</div>
</div>
</div>
<div id="org6e37ef3" class="outline-2">
<h2 id="org6e37ef3"><span class="section-number-2">6</span> spiders</h2>
<div class="outline-text-2" id="text-6">
<p>
定义爬取动作，分析网页的地方
spider中初始的request是通过调用 start<sub>requests</sub>() 来获取的。
start<sub>requests</sub>() 读取 start<sub>urls</sub> 中的URL， 并以 parse 为回调函数生成 Request 。
</p>
</div>
<div id="org9c1ed2c" class="outline-3">
<h3 id="org9c1ed2c"><span class="section-number-3">6.1</span> spider参数</h3>
<div class="outline-text-3" id="text-6-1">
<p>
在运行crawl时，添加-a可以传递spider参数：
scrapy crawl myspider -a category=electronics
spider在构造中获取参数
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> scrapy

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">MySpider</span>(Spider):
    <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">'myspider'</span>

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">__init__</span>(<span style="color: #859900; font-weight: bold;">self</span>, category=<span style="color: #268bd2; font-weight: bold;">None</span>, *args, **kwargs):
        <span style="color: #657b83; font-weight: bold;">super</span>(MySpider, <span style="color: #859900; font-weight: bold;">self</span>).__init__(*args, **kwargs)
        <span style="color: #859900; font-weight: bold;">self</span>.start_urls = [<span style="color: #2aa198;">'http://www.example.com/categories/%s'</span> % category]
        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">...</span>
</pre>
</div>
</div>
</div>
<div id="org29b57a2" class="outline-3">
<h3 id="org29b57a2"><span class="section-number-3">6.2</span> 内置spider参考手册</h3>
<div class="outline-text-3" id="text-6-2">
</div><div id="org96e61f2" class="outline-4">
<h4 id="org96e61f2"><span class="section-number-4">6.2.1</span> spider</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
Spider并没有提供什么特殊的功能。 其仅仅请求给定的 start<sub>urls</sub>/start<sub>requests</sub>，并根据返回的结果(resulting responses)调用spider的 parse 方法。
name:定义spider名字的字符串，唯一。
allowed<sub>domains</sub>:允许爬取的域名列表
start<sub>urls</sub>:url列表，没有特定的URL时，从该列表开始爬取。
</p>
</div>
</div>
<div id="orgf6d7a2c" class="outline-4">
<h4 id="orgf6d7a2c"><span class="section-number-4">6.2.2</span> custom<sub>settings</sub></h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
for detail: <a href="http://scrapy-chs.readthedocs.io/zh_CN/latest/topics/settings.html#topics-settings-ref">http://scrapy-chs.readthedocs.io/zh_CN/latest/topics/settings.html#topics-settings-ref</a>
</p>
</div>
</div>
<div id="orgbb44399" class="outline-4">
<h4 id="orgbb44399"><span class="section-number-4">6.2.3</span> crawler</h4>
<div class="outline-text-4" id="text-6-2-3">
<p>
for detail: <a href="http://scrapy-chs.readthedocs.io/zh_CN/latest/topics/api.html#topics-api-crawler">http://scrapy-chs.readthedocs.io/zh_CN/latest/topics/api.html#topics-api-crawler</a>
</p>
</div>
</div>
<div id="org4a9c8eb" class="outline-4">
<h4 id="org4a9c8eb"><span class="section-number-4">6.2.4</span> start<sub>requests</sub>()</h4>
<div class="outline-text-4" id="text-6-2-4">
<p>
返回一个可迭代的对象，默认使用start<sub>urls的url生成requests</sub>.
可以重写该方法
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">start_requests</span>(<span style="color: #859900; font-weight: bold;">self</span>):
    <span style="color: #859900; font-weight: bold;">return</span> [scrapy.FormRequest(<span style="color: #2aa198;">"http://www.example.com/login"</span>,
                               formdata={<span style="color: #2aa198;">'user'</span>: <span style="color: #2aa198;">'john'</span>, <span style="color: #2aa198;">'pass'</span>: <span style="color: #2aa198;">'secret'</span>},
                               callback=<span style="color: #859900; font-weight: bold;">self</span>.logged_in)]

<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">logged_in</span>(<span style="color: #859900; font-weight: bold;">self</span>, response):
    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">here you would extract links to follow and return Requests for</span>
    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">each of them, with another callback</span>
    <span style="color: #859900; font-weight: bold;">pass</span>
</pre>
</div>
</div>
</div>
