LearnScrapy.md


<a id="org5ce4c85"></a>

### 获取字段的值

    product['name']
    Desktop PC
    product.get('name')
    Desktop PC
    
    product['price']
    1000
    
    product['last_updated']
    Traceback (most recent call last):
        ...
    KeyError: 'last_updated'
    
    product.get('last_updated', 'not set')
    not set
    
    product['lala'] # getting unknown field
    Traceback (most recent call last):
        ...
    KeyError: 'lala'
    
    product.get('lala', 'unknown field')
    'unknown field'
    
    'name' in product  # is name field populated?
    True
    
    'last_updated' in product  # is last_updated populated?
    False
    
    'last_updated' in product.fields  # is last_updated a declared field?
    True
    
    'lala' in product.fields  # is lala a declared field?
    False


<a id="orgf76d585"></a>

### 设置字段的值

    product['last_updated'] = 'today'
    product['last_updated']
    today
    
    product['lala'] = 'test' # setting unknown field
    Traceback (most recent call last):
        ...
    KeyError: 'Product does not support field: lala'


<a id="org266ddc4"></a>

### 获取所有获取的值

product.keys()
product.items()


<a id="org91bbf8a"></a>

## 其他任务


<a id="orgc5d29b8"></a>

### 复制item

product2 = Product(product)
product3 = product2.copy()


<a id="org3f7ae35"></a>

### 根据item创建字典

dict(product)


<a id="org6978ea6"></a>

### 根据字典创建item

Product({'name':'niuniu','price':'expensive'})
Product({'name':'niuniu','lala':'expensive'})#error


<a id="org47caaa7"></a>

## 扩展item

继承原始的item来扩展item

    class DiscountedProduct(Product):
        discount_percent = scrapy.Field(serializer=str)
        discount_expiration_date = scrapy.Field()


<a id="orgfc4d17e"></a>

# spiders

定义爬取动作，分析网页的地方
spider中初始的request是通过调用 start<sub>requests</sub>() 来获取的。
start<sub>requests</sub>() 读取 start<sub>urls</sub> 中的URL， 并以 parse 为回调函数生成 Request 。


<a id="org17c89e7"></a>

## spider参数

在运行crawl时，添加-a可以传递spider参数：
scrapy crawl myspider -a category=electronics
spider在构造中获取参数

    import scrapy
    
    class MySpider(Spider):
        name = 'myspider'
    
        def __init__(self, category=None, *args, **kwargs):
            super(MySpider, self).__init__(*args, **kwargs)
            self.start_urls = ['http://www.example.com/categories/%s' % category]
            # ...


<a id="orga62c85c"></a>

## 内置spider参考手册


<a id="org38184e6"></a>

### spider

Spider并没有提供什么特殊的功能。 其仅仅请求给定的 start<sub>urls</sub>/start<sub>requests</sub>，
并根据返回的结果(resulting responses)调用spider的 parse 方法。
name:定义spider名字的字符串，唯一。
allowed<sub>domains</sub>:允许爬取的域名列表
start<sub>urls</sub>:url列表，没有特定的URL时，从该列表开始爬取。


<a id="orgfec4b85"></a>

### custom<sub>settings</sub>

for detail: <http://scrapy-chs.readthedocs.io/zh_CN/latest/topics/settings.html#topics-settings-ref>


<a id="orgc62019d"></a>

### crawler

for detail: <http://scrapy-chs.readthedocs.io/zh_CN/latest/topics/api.html#topics-api-crawler>


<a id="orgc89c2cf"></a>

### start<sub>requests</sub>()

返回一个可迭代的对象，默认使用start<sub>urls的url生成requests</sub>.
可以重写该方法

    def start_requests(self):
        return [scrapy.FormRequest("http://www.example.com/login",
                                   formdata={'user': 'john', 'pass': 'secret'},
                                   callback=self.logged_in)]
    
    def logged_in(self, response):
        # here you would extract links to follow and return Requests for
        # each of them, with another callback
        pass
