LearnScrapy.html
<div id="org5f77bdd" class="outline-4">
<h4 id="org5f77bdd"><span class="section-number-4">6.2.5</span> parse(response)</h4>
<div class="outline-text-4" id="text-6-2-5">
<p>
当没有指定callback函数时，这个方法是默认的回调函数
</p>
</div>
</div>
<div id="org541eb30" class="outline-4">
<h4 id="org541eb30"><span class="section-number-4">6.2.6</span> log()</h4>
<div class="outline-text-4" id="text-6-2-6">
<p>
for detail:<a href="http://scrapy-chs.readthedocs.io/zh_CN/latest/topics/logging.html#topics-logging">http://scrapy-chs.readthedocs.io/zh_CN/latest/topics/logging.html#topics-logging</a>
</p>
</div>
</div>
<div id="orgc4ee2ef" class="outline-4">
<h4 id="orgc4ee2ef"><span class="section-number-4">6.2.7</span> closed()</h4>
<div class="outline-text-4" id="text-6-2-7">
<p>
spider关闭时调用
</p>
</div>
</div>
</div>
<div id="org8f5e0f3" class="outline-3">
<h3 id="org8f5e0f3"><span class="section-number-3">6.3</span> spider样例</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> scrapy

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">MySpider</span>(scrapy.Spider):
    <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">'example.com'</span>
    <span style="color: #268bd2;">allowed_domains</span> = [<span style="color: #2aa198;">'example.com'</span>]
    <span style="color: #268bd2;">start_urls</span> = [
        <span style="color: #2aa198;">'http://www.example.com/1.html'</span>,
        <span style="color: #2aa198;">'http://www.example.com/2.html'</span>,
        <span style="color: #2aa198;">'http://www.example.com/3.html'</span>,
    ]

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">parse</span>(<span style="color: #859900; font-weight: bold;">self</span>, response):
        <span style="color: #859900; font-weight: bold;">self</span>.log(<span style="color: #2aa198;">'A response from %s just arrived!'</span> % response.url)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> scrapy
<span style="color: #859900; font-weight: bold;">from</span> myproject.items <span style="color: #859900; font-weight: bold;">import</span> MyItem

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">MySpider</span>(scrapy.Spider):
    <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">'example.com'</span>
    <span style="color: #268bd2;">allowed_domains</span> = [<span style="color: #2aa198;">'example.com'</span>]
    <span style="color: #268bd2;">start_urls</span> = [
        <span style="color: #2aa198;">'http://www.example.com/1.html'</span>,
        <span style="color: #2aa198;">'http://www.example.com/2.html'</span>,
        <span style="color: #2aa198;">'http://www.example.com/3.html'</span>,
    ]

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">parse</span>(<span style="color: #859900; font-weight: bold;">self</span>, response):
        <span style="color: #268bd2;">sel</span> = scrapy.Selector(response)
        <span style="color: #859900; font-weight: bold;">for</span> h3 <span style="color: #859900; font-weight: bold;">in</span> response.xpath(<span style="color: #2aa198;">'//h3'</span>).extract():
            <span style="color: #859900; font-weight: bold;">yield</span> MyItem(title=h3)

        <span style="color: #859900; font-weight: bold;">for</span> url <span style="color: #859900; font-weight: bold;">in</span> response.xpath(<span style="color: #2aa198;">'//a/@href'</span>).extract():
            <span style="color: #859900; font-weight: bold;">yield</span> scrapy.Request(url, callback=<span style="color: #859900; font-weight: bold;">self</span>.parse)
</pre>
</div>
</div>
</div>
<div id="org5e1052b" class="outline-3">
<h3 id="org5e1052b"><span class="section-number-3">6.4</span> crawlspider样例</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">import</span> scrapy
<span style="color: #859900; font-weight: bold;">from</span> scrapy.contrib.spiders <span style="color: #859900; font-weight: bold;">import</span> CrawlSpider, Rule
<span style="color: #859900; font-weight: bold;">from</span> scrapy.contrib.linkextractors <span style="color: #859900; font-weight: bold;">import</span> LinkExtractor

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">MySpider</span>(CrawlSpider):
    <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">'example.com'</span>
    <span style="color: #268bd2;">allowed_domains</span> = [<span style="color: #2aa198;">'example.com'</span>]
    <span style="color: #268bd2;">start_urls</span> = [<span style="color: #2aa198;">'http://www.example.com'</span>]

    <span style="color: #268bd2;">rules</span> = (
        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">&#25552;&#21462;&#21305;&#37197; 'category.php' (&#20294;&#19981;&#21305;&#37197; 'subsection.php') &#30340;&#38142;&#25509;&#24182;&#36319;&#36827;&#38142;&#25509;(&#27809;&#26377;callback&#24847;&#21619;&#30528;follow&#40664;&#35748;&#20026;True)</span>
        Rule(LinkExtractor(allow=(<span style="color: #2aa198;">'category\.php'</span>, ), deny=(<span style="color: #2aa198;">'subsection\.php'</span>, ))),

        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">&#25552;&#21462;&#21305;&#37197; 'item.php' &#30340;&#38142;&#25509;&#24182;&#20351;&#29992;spider&#30340;parse_item&#26041;&#27861;&#36827;&#34892;&#20998;&#26512;</span>
        Rule(LinkExtractor(allow=(<span style="color: #2aa198;">'item\.php'</span>, )), callback=<span style="color: #2aa198;">'parse_item'</span>),
    )

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">parse_item</span>(<span style="color: #859900; font-weight: bold;">self</span>, response):
        <span style="color: #859900; font-weight: bold;">self</span>.log(<span style="color: #2aa198;">'Hi, this is an item page! %s'</span> % response.url)

        <span style="color: #268bd2;">item</span> = scrapy.Item()
        <span style="color: #268bd2;">item</span>[<span style="color: #2aa198;">'id'</span>] = response.xpath(<span style="color: #2aa198;">'//td[@id="item_id"]/text()'</span>).re(r<span style="color: #2aa198;">'ID: (\d+)'</span>)
        <span style="color: #268bd2;">item</span>[<span style="color: #2aa198;">'name'</span>] = response.xpath(<span style="color: #2aa198;">'//td[@id="item_name"]/text()'</span>).extract()
        <span style="color: #268bd2;">item</span>[<span style="color: #2aa198;">'description'</span>] = response.xpath(<span style="color: #2aa198;">'//td[@id="item_description"]/text()'</span>).extract()
        <span style="color: #859900; font-weight: bold;">return</span> item
</pre>
</div>
</div>
</div>
<div id="org80c6bf9" class="outline-3">
<h3 id="org80c6bf9"><span class="section-number-3">6.5</span> XMLFeedSpider</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">from</span> scrapy <span style="color: #859900; font-weight: bold;">import</span> log
<span style="color: #859900; font-weight: bold;">from</span> scrapy.contrib.spiders <span style="color: #859900; font-weight: bold;">import</span> XMLFeedSpider
<span style="color: #859900; font-weight: bold;">from</span> myproject.items <span style="color: #859900; font-weight: bold;">import</span> TestItem

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">MySpider</span>(XMLFeedSpider):
    <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">'example.com'</span>
    <span style="color: #268bd2;">allowed_domains</span> = [<span style="color: #2aa198;">'example.com'</span>]
    <span style="color: #268bd2;">start_urls</span> = [<span style="color: #2aa198;">'http://www.example.com/feed.xml'</span>]
    <span style="color: #268bd2;">iterator</span> = <span style="color: #2aa198;">'iternodes'</span> <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">This is actually unnecessary, since it's the default value</span>
    <span style="color: #268bd2;">itertag</span> = <span style="color: #2aa198;">'item'</span>

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">parse_node</span>(<span style="color: #859900; font-weight: bold;">self</span>, response, node):
        log.msg(<span style="color: #2aa198;">'Hi, this is a &lt;%s&gt; node!: %s'</span> % (<span style="color: #859900; font-weight: bold;">self</span>.itertag, <span style="color: #2aa198;">''</span>.join(node.extract())))

        <span style="color: #268bd2;">item</span> = TestItem()
        <span style="color: #268bd2;">item</span>[<span style="color: #2aa198;">'id'</span>] = node.xpath(<span style="color: #2aa198;">'@id'</span>).extract()
        <span style="color: #268bd2;">item</span>[<span style="color: #2aa198;">'name'</span>] = node.xpath(<span style="color: #2aa198;">'name'</span>).extract()
        <span style="color: #268bd2;">item</span>[<span style="color: #2aa198;">'description'</span>] = node.xpath(<span style="color: #2aa198;">'description'</span>).extract()
        <span style="color: #859900; font-weight: bold;">return</span> item
</pre>
</div>
</div>
</div>
