LearnScrapy.org
** CSVFeedSpider
#+BEGIN_SRC python
from scrapy import log
from scrapy.contrib.spiders import CSVFeedSpider
from myproject.items import TestItem

class MySpider(CSVFeedSpider):
    name = 'example.com'
    allowed_domains = ['example.com']
    start_urls = ['http://www.example.com/feed.csv']
    delimiter = ';'
    quotechar = "'"
    headers = ['id', 'name', 'description']

    def parse_row(self, response, row):
        log.msg('Hi, this is a row!: %r' % row)

        item = TestItem()
        item['id'] = row['id']
        item['name'] = row['name']
        item['description'] = row['description']
        return item
#+END_SRC
* 选择器
BeautifulSoup,lxml,xpath
** 使用选择器
构造选择器
#+BEGIN_SRC python
>>> from scrapy.selector import Selector
>>> from scrapy.http import HtmlResponse
#+END_SRC
用文字构造
#+BEGIN_SRC python
>>> body = '<html><body><span>good</span></body></html>'
>>> Selector(text=body).xpath('//span/text()').extract()
#+END_SRC
用response构造
#+BEGIN_SRC python
>>> response = HtmlResponse(url='http://example.com', body=body)
>>> Selector(response=response).xpath('//span/text()').extract()
#+END_SRC
用select属性
#+BEGIN_SRC python
>>> response.selector.xpath('//span/text()').extract()
#+END_SRC
** 嵌套选择器
** 正则表达式
#+BEGIN_SRC python
response.xpath('//a[contains(@href, "image")]/text()').re(r'Name:\s*(.*)')
#+END_SRC
** 使用相对路径
绝对路径以/开始
#+BEGIN_SRC python
>>> divs = response.xpath('//div')
>>> for p in divs.xpath('//p'):  # this is wrong - gets all <p> from the whole document
...     print p.extract()
>>> for p in divs.xpath('.//p'):  # extracts all <p> inside
...     print p.extract()
>>> for p in divs.xpath('p'):
...     print p.extract()
#+END_SRC
** 使用建议
*** Using text nodes in a condition
When you need to use the text content as argument to a XPath string function,
avoid using .//text() and use just . instead.
*** Beware the difference between //node[1] and (//node)[1]
//node[1] selects all the nodes occurring first under their respective parents
(//node)[1] selects all the nodes in the document, and then gets only the first of them.
*** When querying by class, consider using CSS
#+BEGIN_SRC python
>>> from scrapy import Selector
>>> sel = Selector(text='<div class="hero shout"><time datetime="2014-07-23 19:00">Special date</time></div>')
>>> sel.css('.shout').xpath('./time/@datetime').extract()
[u'2014-07-23 19:00']
#+END_SRC
* Item Loaders
Item Loaders提供的是一种灵活，高效的机制，可以更方便的被spider或source format (HTML, XML, etc)扩展，
并override更易于维护的、不同的内容分析规则.
** Using Item Loaders to populate items
#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2017-05-27 周六 11:16]
| Headline     | Time   |   |
|--------------+--------+---|
| *Total time* | *0:00* |   |
#+END:
