LearnScrapy.html
<div id="orgf9cee0d" class="outline-3">
<h3 id="orgf9cee0d"><span class="section-number-3">6.6</span> CSVFeedSpider</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">from</span> scrapy <span style="color: #859900; font-weight: bold;">import</span> log
<span style="color: #859900; font-weight: bold;">from</span> scrapy.contrib.spiders <span style="color: #859900; font-weight: bold;">import</span> CSVFeedSpider
<span style="color: #859900; font-weight: bold;">from</span> myproject.items <span style="color: #859900; font-weight: bold;">import</span> TestItem

<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">MySpider</span>(CSVFeedSpider):
    <span style="color: #268bd2;">name</span> = <span style="color: #2aa198;">'example.com'</span>
    <span style="color: #268bd2;">allowed_domains</span> = [<span style="color: #2aa198;">'example.com'</span>]
    <span style="color: #268bd2;">start_urls</span> = [<span style="color: #2aa198;">'http://www.example.com/feed.csv'</span>]
    <span style="color: #268bd2;">delimiter</span> = <span style="color: #2aa198;">';'</span>
    <span style="color: #268bd2;">quotechar</span> = <span style="color: #2aa198;">"'"</span>
    <span style="color: #268bd2;">headers</span> = [<span style="color: #2aa198;">'id'</span>, <span style="color: #2aa198;">'name'</span>, <span style="color: #2aa198;">'description'</span>]

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">parse_row</span>(<span style="color: #859900; font-weight: bold;">self</span>, response, row):
        log.msg(<span style="color: #2aa198;">'Hi, this is a row!: %r'</span> % row)

        <span style="color: #268bd2;">item</span> = TestItem()
        <span style="color: #268bd2;">item</span>[<span style="color: #2aa198;">'id'</span>] = row[<span style="color: #2aa198;">'id'</span>]
        <span style="color: #268bd2;">item</span>[<span style="color: #2aa198;">'name'</span>] = row[<span style="color: #2aa198;">'name'</span>]
        <span style="color: #268bd2;">item</span>[<span style="color: #2aa198;">'description'</span>] = row[<span style="color: #2aa198;">'description'</span>]
        <span style="color: #859900; font-weight: bold;">return</span> item
</pre>
</div>
</div>
</div>
</div>
<div id="org44eca2b" class="outline-2">
<h2 id="org44eca2b"><span class="section-number-2">7</span> 选择器</h2>
<div class="outline-text-2" id="text-7">
<p>
BeautifulSoup,lxml,xpath
</p>
</div>
<div id="org8f16252" class="outline-3">
<h3 id="org8f16252"><span class="section-number-3">7.1</span> 使用选择器</h3>
<div class="outline-text-3" id="text-7-1">
<p>
构造选择器
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #859900; font-weight: bold;">from</span> scrapy.selector <span style="color: #859900; font-weight: bold;">import</span> Selector
&gt;&gt;&gt; <span style="color: #859900; font-weight: bold;">from</span> scrapy.http <span style="color: #859900; font-weight: bold;">import</span> HtmlResponse
</pre>
</div>
<p>
用文字构造
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #268bd2;">body</span> = <span style="color: #2aa198;">'&lt;html&gt;&lt;body&gt;&lt;span&gt;good&lt;/span&gt;&lt;/body&gt;&lt;/html&gt;'</span>
&gt;&gt;&gt; Selector(text=body).xpath(<span style="color: #2aa198;">'//span/text()'</span>).extract()
</pre>
</div>
<p>
用response构造
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #268bd2;">response</span> = HtmlResponse(url=<span style="color: #2aa198;">'http://example.com'</span>, body=body)
&gt;&gt;&gt; Selector(response=response).xpath(<span style="color: #2aa198;">'//span/text()'</span>).extract()
</pre>
</div>
<p>
用select属性
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; response.selector.xpath(<span style="color: #2aa198;">'//span/text()'</span>).extract()
</pre>
</div>
</div>
</div>
<div id="org7d091dd" class="outline-3">
<h3 id="org7d091dd"><span class="section-number-3">7.2</span> 嵌套选择器</h3>
</div>
<div id="org93d49f7" class="outline-3">
<h3 id="org93d49f7"><span class="section-number-3">7.3</span> 正则表达式</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-python">response.xpath(<span style="color: #2aa198;">'//a[contains(@href, "image")]/text()'</span>).re(r<span style="color: #2aa198;">'Name:\s*(.*)'</span>)
</pre>
</div>
</div>
</div>
<div id="org1d11ade" class="outline-3">
<h3 id="org1d11ade"><span class="section-number-3">7.4</span> 使用相对路径</h3>
<div class="outline-text-3" id="text-7-4">
<p>
绝对路径以/开始
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #268bd2;">divs</span> = response.xpath(<span style="color: #2aa198;">'//div'</span>)
&gt;&gt;&gt; <span style="color: #859900; font-weight: bold;">for</span> p <span style="color: #859900; font-weight: bold;">in</span> divs.xpath(<span style="color: #2aa198;">'//p'</span>):  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">this is wrong - gets all &lt;p&gt; from the whole document</span>
...     <span style="color: #859900; font-weight: bold;">print</span> p.extract()
&gt;&gt;&gt; <span style="color: #859900; font-weight: bold;">for</span> p <span style="color: #859900; font-weight: bold;">in</span> divs.xpath(<span style="color: #2aa198;">'.//p'</span>):  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">extracts all &lt;p&gt; inside</span>
...     <span style="color: #859900; font-weight: bold;">print</span> p.extract()
&gt;&gt;&gt; <span style="color: #859900; font-weight: bold;">for</span> p <span style="color: #859900; font-weight: bold;">in</span> divs.xpath(<span style="color: #2aa198;">'p'</span>):
...     <span style="color: #859900; font-weight: bold;">print</span> p.extract()
</pre>
</div>
</div>
</div>
<div id="orga42f9eb" class="outline-3">
<h3 id="orga42f9eb"><span class="section-number-3">7.5</span> 使用建议</h3>
<div class="outline-text-3" id="text-7-5">
</div><div id="org717c253" class="outline-4">
<h4 id="org717c253"><span class="section-number-4">7.5.1</span> Using text nodes in a condition</h4>
<div class="outline-text-4" id="text-7-5-1">
<p>
When you need to use the text content as argument to a XPath string function,
avoid using .//text() and use just . instead.
</p>
</div>
</div>
<div id="org29a1cd9" class="outline-4">
<h4 id="org29a1cd9"><span class="section-number-4">7.5.2</span> Beware the difference between //node[1] and (//node)[1]</h4>
<div class="outline-text-4" id="text-7-5-2">
<p>
//node[1] selects all the nodes occurring first under their respective parents
(//node)[1] selects all the nodes in the document, and then gets only the first of them.
</p>
</div>
</div>
<div id="org734d9e2" class="outline-4">
<h4 id="org734d9e2"><span class="section-number-4">7.5.3</span> When querying by class, consider using CSS</h4>
<div class="outline-text-4" id="text-7-5-3">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #859900; font-weight: bold;">from</span> scrapy <span style="color: #859900; font-weight: bold;">import</span> Selector
&gt;&gt;&gt; <span style="color: #268bd2;">sel</span> = Selector(text=<span style="color: #2aa198;">'&lt;div class="hero shout"&gt;&lt;time datetime="2014-07-23 19:00"&gt;Special date&lt;/time&gt;&lt;/div&gt;'</span>)
&gt;&gt;&gt; sel.css(<span style="color: #2aa198;">'.shout'</span>).xpath(<span style="color: #2aa198;">'./time/@datetime'</span>).extract()
[u<span style="color: #2aa198;">'2014-07-23 19:00'</span>]
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="org1d3c969" class="outline-2">
<h2 id="org1d3c969"><span class="section-number-2">8</span> Item Loaders</h2>
<div class="outline-text-2" id="text-8">
<p>
Item Loaders提供的是一种灵活，高效的机制，可以更方便的被spider或source format (HTML, XML, etc)扩展，并override更易于维护的、不同的内容分析规则.
</p>
</div>
<div id="org7d0dcfd" class="outline-3">
<h3 id="org7d0dcfd"><span class="section-number-3">8.1</span> Using Item Loaders to populate items</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-05-27 周六 11:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
