LearnScrapy.md


<a id="org05a5f52"></a>

## CSVFeedSpider

    from scrapy import log
    from scrapy.contrib.spiders import CSVFeedSpider
    from myproject.items import TestItem
    
    class MySpider(CSVFeedSpider):
        name = 'example.com'
        allowed_domains = ['example.com']
        start_urls = ['http://www.example.com/feed.csv']
        delimiter = ';'
        quotechar = "'"
        headers = ['id', 'name', 'description']
    
        def parse_row(self, response, row):
            log.msg('Hi, this is a row!: %r' % row)
    
            item = TestItem()
            item['id'] = row['id']
            item['name'] = row['name']
            item['description'] = row['description']
            return item


<a id="orga106d87"></a>

# 选择器

BeautifulSoup,lxml,xpath


<a id="orgcf18ff9"></a>

## 使用选择器

构造选择器

    >>> from scrapy.selector import Selector
    >>> from scrapy.http import HtmlResponse

用文字构造

    >>> body = '<html><body><span>good</span></body></html>'
    >>> Selector(text=body).xpath('//span/text()').extract()

用response构造

    >>> response = HtmlResponse(url='http://example.com', body=body)
    >>> Selector(response=response).xpath('//span/text()').extract()

用select属性

    >>> response.selector.xpath('//span/text()').extract()


<a id="orgf6d462f"></a>

## 嵌套选择器


<a id="orge3e1afe"></a>

## 正则表达式

    response.xpath('//a[contains(@href, "image")]/text()').re(r'Name:\s*(.*)')


<a id="org1d4db13"></a>

## 使用相对路径

绝对路径以/开始

    >>> divs = response.xpath('//div')
    >>> for p in divs.xpath('//p'):  # this is wrong - gets all <p> from the whole document
    ...     print p.extract()
    >>> for p in divs.xpath('.//p'):  # extracts all <p> inside
    ...     print p.extract()
    >>> for p in divs.xpath('p'):
    ...     print p.extract()


<a id="org894995f"></a>

## 使用建议


<a id="org44eeecd"></a>

### Using text nodes in a condition

When you need to use the text content as argument to a XPath string function,
avoid using .//text() and use just . instead.


<a id="orgb102652"></a>

### Beware the difference between //node[1] and (//node)[1]

//node[1] selects all the nodes occurring first under their respective parents
(//node)[1] selects all the nodes in the document, and then gets only the first of them.


<a id="org05db57d"></a>

### When querying by class, consider using CSS

    >>> from scrapy import Selector
    >>> sel = Selector(text='<div class="hero shout"><time datetime="2014-07-23 19:00">Special date</time></div>')
    >>> sel.css('.shout').xpath('./time/@datetime').extract()
    [u'2014-07-23 19:00']


<a id="orgf2bbde4"></a>

# Item Loaders

Item Loaders提供的是一种灵活，高效的机制，可以更方便的被spider或source format (HTML, XML, etc)扩展，
并override更易于维护的、不同的内容分析规则.


<a id="org13d26b8"></a>

## Using Item Loaders to populate items

